# Imports

In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
from pydataset import data

np.random.seed(123)

# Exercises I

## 3

In [3]:
from env import host, user, password

In [4]:
def get_db_url(user,host,password,dbname):
	url = f'mysql+pymysql://{user}:{password}@{host}/{dbname}'
	return url

In [5]:
# from env import get_db_url

In [6]:

# dbname='employees'
# get_db_url(dbname)

## 4

In [7]:
dbname='employees'
url=get_db_url(user,host,password,dbname)

In [8]:
pd.read_sql('''SELECT * FROM employees LIMIT 5 OFFSET 50''', url)

   emp_no  birth_date first_name  last_name gender   hire_date
0   10051  1953-07-28   Hidefumi      Caine      M  1992-10-15
1   10052  1961-02-26     Heping     Nitsch      M  1988-05-21
2   10053  1954-09-13     Sanjiv   Zschoche      F  1986-02-04
3   10054  1957-04-04     Mayumi  Schueller      M  1995-03-13
4   10055  1956-06-06     Georgy     Dredge      M  1992-04-27

## 5

### a

In [9]:
dbname='employes'
url=get_db_url(user,host,password,dbname)

In [10]:
# pd.read_sql('''SELECT * FROM employees LIMIT 5 OFFSET 50''', url)

OperationalError: (pymysql.err.OperationalError) (1044, "Access denied for user 'innis_1652'@'%' to database 'employes'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

### b

In [11]:
# pd.read_sql('SELECT * FROM employees LIMT 5 OFFSET 50', url)

(pymysql.err.OperationalError) (1044, "Access denied for user 'innis_1652'@'%' to database 'employes'")
(Background on this error at: https://sqlalche.me/e/14/e3q8)

## 6

In [12]:
dbname='employees'
url=get_db_url(user,host,password,dbname)
employees=pd.read_sql('SELECT * FROM employees', url)

In [13]:
employees

        emp_no  birth_date first_name last_name gender   hire_date
0        10001  1953-09-02     Georgi   Facello      M  1986-06-26
1        10002  1964-06-02    Bezalel    Simmel      F  1985-11-21
2        10003  1959-12-03      Parto   Bamford      M  1986-08-28
3        10004  1954-05-01  Chirstian   Koblick      M  1986-12-01
4        10005  1955-01-21    Kyoichi  Maliniak      M  1989-09-12
...        ...         ...        ...       ...    ...         ...
300019  499995  1958-09-24     Dekang  Lichtner      F  1993-01-12
300020  499996  1953-03-07       Zito      Baaz      M  1990-09-27
300021  499997  1961-08-03    Berhard    Lenart      M  1986-04-21
300022  499998  1956-09-05   Patricia   Breugel      M  1993-10-13
300023  499999  1958-05-01     Sachin   Tsukuda      M  1997-11-30

[300024 rows x 6 columns]

In [14]:
dbname='employees'
url=get_db_url(user,host,password,dbname)
titles=pd.read_sql('SELECT * FROM titles', url)

In [15]:
titles

        emp_no            title   from_date     to_date
0        10001  Senior Engineer  1986-06-26  9999-01-01
1        10002            Staff  1996-08-03  9999-01-01
2        10003  Senior Engineer  1995-12-03  9999-01-01
3        10004         Engineer  1986-12-01  1995-12-01
4        10004  Senior Engineer  1995-12-01  9999-01-01
...        ...              ...         ...         ...
443303  499997         Engineer  1987-08-30  1992-08-29
443304  499997  Senior Engineer  1992-08-29  9999-01-01
443305  499998     Senior Staff  1998-12-27  9999-01-01
443306  499998            Staff  1993-12-27  1998-12-27
443307  499999         Engineer  1997-11-30  9999-01-01

[443308 rows x 4 columns]

## 7

In [16]:
employees.shape

(300024, 6)

In [17]:
titles.shape

(443308, 4)

## 8

In [18]:
employees.describe()

              emp_no
count  300024.000000
mean   253321.763392
std    161828.235540
min     10001.000000
25%     85006.750000
50%    249987.500000
75%    424993.250000
max    499999.000000

In [19]:
titles.describe()

              emp_no
count  443308.000000
mean   253075.034430
std    161853.292613
min     10001.000000
25%     84855.750000
50%    249847.500000
75%    424891.250000
max    499999.000000


## 9

In [20]:
titles.title.value_counts()

Engineer              115003
Staff                 107391
Senior Engineer        97750
Senior Staff           92853
Technique Leader       15159
Assistant Engineer     15128
Manager                   24
Name: title, dtype: int64

In [21]:
titles.title.unique()

array(['Senior Engineer', 'Staff', 'Engineer', 'Senior Staff',
       'Assistant Engineer', 'Technique Leader', 'Manager'], dtype=object)

## 10

In [99]:
str(titles['to_date'].min())

'1985-03-01'

## 11

In [101]:
str(titles['to_date'].max())

'9999-01-01'

In [103]:
current = titles.to_date.max()
titles.to_date[titles.to_date != current].max()

datetime.date(2002, 8, 1)

# Indexing and Subsetting

In [25]:
# Create list of values for names column.

students = ['Sally', 'Jane', 'Suzie', 'Billy', 'Ada', 'John', 'Thomas',
            'Marie', 'Albert', 'Richard', 'Isaac', 'Alan']

# Randomly generate arrays of scores for each student for each subject.
# Note that all the values need to have the same length here.

math_grades = np.random.randint(low=60, high=100, size=len(students))
english_grades = np.random.randint(low=60, high=100, size=len(students))
reading_grades = np.random.randint(low=60, high=100, size=len(students))

In [26]:
# Construct the DataFrame using the above lists and arrays.

df = pd.DataFrame({'name': students,
                   'math': math_grades,
                   'english': english_grades,
                   'reading': reading_grades,
                   'classroom': np.random.choice(['A', 'B'], len(students))})

In [27]:
df[['name', 'classroom']]

       name classroom
0     Sally         A
1      Jane         B
2     Suzie         B
3     Billy         B
4       Ada         B
5      John         B
6    Thomas         B
7     Marie         B
8    Albert         A
9   Richard         B
10    Isaac         B
11     Alan         A

In [32]:
type(df[['name', 'classroom']])

pandas.core.frame.DataFrame

In [33]:
df['name']

0       Sally
1        Jane
2       Suzie
3       Billy
4         Ada
5        John
6      Thomas
7       Marie
8      Albert
9     Richard
10      Isaac
11       Alan
Name: name, dtype: object

In [30]:
type(df['name'])

pandas.core.series.Series

In [39]:
bools = df.name.str.startswith('A')
bools

0     False
1     False
2     False
3     False
4      True
5     False
6     False
7     False
8      True
9     False
10    False
11     True
Name: name, dtype: bool

In [35]:
df[bools]

      name  math  english  reading classroom
4      Ada    96       87       76         B
8   Albert    98       91       93         A
11    Alan    86       89       66         A


## .loc

In [36]:
df.loc[:, 'math':'reading']

    math  english  reading
0     97       95       76
1     89       67       80
2     95       73       95
3     85       64       62
4     96       87       76
5     74       71       76
6     74       83       68
7     93       68       71
8     98       91       93
9     90       71       82
10    61       95       72
11    86       89       66

In [37]:
df.loc[bools, 'name': 'reading']

      name  math  english  reading
4      Ada    96       87       76
8   Albert    98       91       93
11    Alan    86       89       66

## .iloc

In [38]:
df.iloc[:3]

    name  math  english  reading classroom
0  Sally    97       95       76         A
1   Jane    89       67       80         B
2  Suzie    95       73       95         B

In [40]:
df.iloc[:3, 1:3]

   math  english
0    97       95
1    89       67
2    95       73

# Aggregating

## .agg

In [41]:
df.reading.agg('min')

62

In [42]:
df[['english', 'reading', 'math']].agg(['mean', 'min', 'max'])

      english    reading  math
mean     79.5  76.416667  86.5
min      64.0  62.000000  61.0
max      95.0  95.000000  98.0

## .groupby

In [43]:
df.groupby('classroom').math.max()

classroom
A    98
B    96
Name: math, dtype: int64

In [44]:
df.groupby('classroom').math.agg(['min', 'mean', 'max'])

           min       mean  max
classroom
A           86  93.666667   98
B           61  84.111111   96

## np.where

In [45]:
df['passing_math'] = np.where(df.math < 70, 'failing', 'passing')
df

       name  math  english  reading classroom passing_math
0     Sally    97       95       76         A      passing
1      Jane    89       67       80         B      passing
2     Suzie    95       73       95         B      passing
3     Billy    85       64       62         B      passing
4       Ada    96       87       76         B      passing
5      John    74       71       76         B      passing
6    Thomas    74       83       68         B      passing
7     Marie    93       68       71         B      passing
8    Albert    98       91       93         A      passing
9   Richard    90       71       82         B      passing
10    Isaac    61       95       72         B      failing
11     Alan    86       89       66         A      passing

In [46]:
grade_groups = df.groupby(['passing_math', 'classroom']).reading.agg(['mean', 'count'])
grade_groups

                             mean  count
passing_math classroom
failing      B          72.000000      1
passing      A          78.333333      3
             B          76.250000      8

In [47]:
grade_groups.columns = ['avg_reading_grade', 'count_of_students']
grade_groups

                        avg_reading_grade  count_of_students
passing_math classroom
failing      B                  72.000000                  1
passing      A                  78.333333                  3
             B                  76.250000                  8

## .transform

In [48]:
df.assign(avg_math_score_by_classroom=df.groupby('classroom').math.transform('mean'))

,name,math,english,reading,classroom,passing_math,avg_math_score_by_classroom
0,Sally,97,95,76,A,passing,93.666667
1,Jane,89,67,80,B,passing,84.111111
2,Suzie,95,73,95,B,passing,84.111111
3,Billy,85,64,62,B,passing,84.111111
4,Ada,96,87,76,B,passing,84.111111
5,John,74,71,76,B,passing,84.111111
6,Thomas,74,83,68,B,passing,84.111111
7,Marie,93,68,71,B,passing,84.111111
8,Albert,98,91,93,A,passing,93.666667
9,Richard,90,71,82,B,passing,84.111111
10,Isaac,61,95,72,B,failing,84.111111
11,Alan,86,89,66,A,passing,93.666667

## .describe

In [49]:
df.groupby('classroom').reading.describe()

           count       mean        std   min   25%   50%   75%   max
classroom
A            3.0  78.333333  13.650397  66.0  71.0  76.0  84.5  93.0
B            9.0  75.777778   9.444281  62.0  71.0  76.0  80.0  95.0

# Merging and Joining

## pd.concat

In [51]:
df1 = pd.DataFrame({'a': [1, 2, 3]})
df2 = pd.DataFrame({'a': [4, 5, 6]})

In [52]:
df1

   a
0  1
1  2
2  3

In [53]:
df2

   a
0  4
1  5
2  6

In [59]:
df3=pd.concat([df1, df2])

In [61]:
df3

   a
0  1
1  2
2  3
0  4
1  5
2  6

In [62]:
df3.iloc[3]

a    4
Name: 0, dtype: int64

In [64]:
concat_df1 = pd.concat([df1, df2], ignore_index=True)
concat_df1

   a
0  1
1  2
2  3
3  4
4  5
5  6

In [65]:
concat_df2 = pd.DataFrame({'b': [1, 2, 3, 4, 5, 6]})
concat_df2

   b
0  1
1  2
2  3
3  4
4  5
5  6

In [66]:
pd.concat([concat_df1, concat_df2], axis=1)

   a  b
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5
5  6  6

## .merge

In [67]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [68]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

In [69]:
users.merge(roles, left_on='role_id', right_on='id', how='outer', indicator=True)

   id_x name_x  role_id  id_y     name_y      _merge
0   1.0    bob      1.0   1.0      admin        both
1   2.0    joe      2.0   2.0     author        both
2   3.0  sally      3.0   3.0   reviewer        both
3   4.0   adam      3.0   3.0   reviewer        both
4   5.0   jane      NaN   NaN        NaN   left_only
5   6.0   mike      NaN   NaN        NaN   left_only
6   NaN    NaN      NaN   4.0  commenter  right_only

In [70]:
(users.merge(roles, 
            left_on='role_id', 
            right_on='id', 
            how='outer')
    .drop(columns='role_id')
    .rename(columns={'id_x': 'id', 
                     'name_x': 'employee',
                     'id_y': 'role_id',
                     'name_y': 'role'}
            )
)

    id employee  role_id       role
0  1.0      bob      1.0      admin
1  2.0      joe      2.0     author
2  3.0    sally      3.0   reviewer
3  4.0     adam      3.0   reviewer
4  5.0     jane      NaN        NaN
5  6.0     mike      NaN        NaN
6  NaN      NaN      4.0  commenter

# Exercises II

## 1

In [71]:
users = pd.DataFrame({
    'id': [1, 2, 3, 4, 5, 6],
    'name': ['bob', 'joe', 'sally', 'adam', 'jane', 'mike'],
    'role_id': [1, 2, 3, 3, np.nan, np.nan]
})
users

   id   name  role_id
0   1    bob      1.0
1   2    joe      2.0
2   3  sally      3.0
3   4   adam      3.0
4   5   jane      NaN
5   6   mike      NaN

In [72]:
roles = pd.DataFrame({
    'id': [1, 2, 3, 4],
    'name': ['admin', 'author', 'reviewer', 'commenter']
})
roles

   id       name
0   1      admin
1   2     author
2   3   reviewer
3   4  commenter

## 2

In [73]:
users.merge(roles,how='right', indicator=True)

   id       name  role_id      _merge
0   1      admin      NaN  right_only
1   2     author      NaN  right_only
2   3   reviewer      NaN  right_only
3   4  commenter      NaN  right_only

## 3

In [77]:
users.merge(roles,how='outer', indicator=True)

   id       name  role_id      _merge
0   1        bob      1.0   left_only
1   2        joe      2.0   left_only
2   3      sally      3.0   left_only
3   4       adam      3.0   left_only
4   5       jane      NaN   left_only
5   6       mike      NaN   left_only
6   1      admin      NaN  right_only
7   2     author      NaN  right_only
8   3   reviewer      NaN  right_only
9   4  commenter      NaN  right_only

## 4

In [80]:
users.drop(columns='id').merge(roles.drop(columns='id'),how='outer', left_index=True, right_index=True, indicator=True)

  name_x  role_id     name_y     _merge
0    bob      1.0      admin       both
1    joe      2.0     author       both
2  sally      3.0   reviewer       both
3   adam      3.0  commenter       both
4   jane      NaN        NaN  left_only
5   mike      NaN        NaN  left_only

In [82]:
users.merge(roles,how='outer', left_index=True, right_index=True, indicator=True)

   id_x name_x  role_id  id_y     name_y     _merge
0     1    bob      1.0   1.0      admin       both
1     2    joe      2.0   2.0     author       both
2     3  sally      3.0   3.0   reviewer       both
3     4   adam      3.0   4.0  commenter       both
4     5   jane      NaN   NaN        NaN  left_only
5     6   mike      NaN   NaN        NaN  left_only

In [81]:
users.drop(columns='id').merge(roles.drop(columns='id'),how='outer', indicator=True)

        name  role_id      _merge
0        bob      1.0   left_only
1        joe      2.0   left_only
2      sally      3.0   left_only
3       adam      3.0   left_only
4       jane      NaN   left_only
5       mike      NaN   left_only
6      admin      NaN  right_only
7     author      NaN  right_only
8   reviewer      NaN  right_only
9  commenter      NaN  right_only

## 5

In [84]:
mpg = data('mpg')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact
...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize

## 6

In [85]:
data('mpg', show_doc=True)

mpg

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Fuel economy data from 1999 and 2008 for 38 popular models of car

### Description

This dataset contains a subset of the fuel economy data that the EPA makes
available on http://fueleconomy.gov. It contains only models which had a new
release every year between 1999 and 2008 - this was used as a proxy for the
popularity of the car.

### Usage

    data(mpg)

### Format

A data frame with 234 rows and 11 variables

### Details

  * manufacturer.

  * model.

  * displ. engine displacement, in litres

  * year.

  * cyl. number of cylinders

  * trans. type of transmission

  * drv. f = front-wheel drive, r = rear wheel drive, 4 = 4wd

  * cty. city miles per gallon

  * hwy. highway miles per gallon

  * fl.

  * class.

## 7

In [86]:
mpg.shape

(234, 11)

## 8

In [87]:
mpg.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 234 entries, 1 to 234
Data columns (total 11 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   manufacturer  234 non-null    object
 1   model         234 non-null    object
 2   displ         234 non-null    float64
 3   year          234 non-null    int64
 4   cyl           234 non-null    int64
 5   trans         234 non-null    object
 6   drv           234 non-null    object
 7   cty           234 non-null    int64
 8   hwy           234 non-null    int64
 9   fl            234 non-null    object
 10  class         234 non-null    object
dtypes: float64(1), int64(4), object(6)
memory usage: 21.9+ KB

## 9

In [88]:
mpg.describe()

            displ         year         cyl         cty         hwy
count  234.000000   234.000000  234.000000  234.000000  234.000000
mean     3.471795  2003.500000    5.888889   16.858974   23.440171
std      1.291959     4.509646    1.611534    4.255946    5.954643
min      1.600000  1999.000000    4.000000    9.000000   12.000000
25%      2.400000  1999.000000    4.000000   14.000000   18.000000
50%      3.300000  2003.500000    6.000000   17.000000   24.000000
75%      4.600000  2008.000000    8.000000   19.000000   27.000000
max      7.000000  2008.000000    8.000000   35.000000   44.000000

## 10

In [97]:
mpg.manufacturer.unique().size

15

## 11

In [98]:
mpg.model.unique().size

38

## 12

In [106]:
mpg['mileage_difference']=mpg.hwy-mpg.cty
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10
...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9

## 13

In [108]:
mpg['average_mileage'] = mpg[['cty', 'hwy']].mean(axis=1)
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5

## 14

In [110]:
mpg['is_automatic']=mpg.trans.str.contains('auto')
mpg

,manufacturer,model,displ,year,cyl,trans,drv,cty,hwy,fl,class,mileage_difference,average_mileage,is_automatic
1,audi,a4,1.8,1999,4,auto(l5),f,18,29,p,compact,11,23.5,True
2,audi,a4,1.8,1999,4,manual(m5),f,21,29,p,compact,8,25.0,False
3,audi,a4,2.0,2008,4,manual(m6),f,20,31,p,compact,11,25.5,False
4,audi,a4,2.0,2008,4,auto(av),f,21,30,p,compact,9,25.5,True
5,audi,a4,2.8,1999,6,auto(l5),f,16,26,p,compact,10,21.0,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
230,volkswagen,passat,2.0,2008,4,auto(s6),f,19,28,p,midsize,9,23.5,True
231,volkswagen,passat,2.0,2008,4,manual(m6),f,21,29,p,midsize,8,25.0,False
232,volkswagen,passat,2.8,1999,6,auto(l5),f,16,26,p,midsize,10,21.0,True
233,volkswagen,passat,2.8,1999,6,manual(m5),f,18,26,p,midsize,8,22.0,False
234,volkswagen,passat,3.6,2008,6,auto(s6),f,17,26,p,midsize,9,21.5,True

## 15

In [127]:
mpg.groupby('manufacturer').average_mileage.mean().idxmax()

'honda'

In [143]:
mpg.groupby('manufacturer').displ.mean().idxmax()

'lincoln'

## 16

In [122]:
mpg.groupby('is_automatic').average_mileage.mean()

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64

In [124]:
mpg.groupby('is_automatic').average_mileage.agg('mean')

is_automatic
False    22.227273
True     19.130573
Name: average_mileage, dtype: float64